src_test/test-jax/ws-handlers/etc/trace/ci-tr-so-ok.txt


Handler C... error behaviour:

|--------- |--------------|------------------------|---------------------------|
|          | return false | throw RuntimeException | throw SOAPFaultException  |
|----------|--------------|------------------------|---------------------------|
|Client OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server IN |              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Client IN |              |           X            |                           |
|----------|--------------|------------------------|---------------------------|
|Server OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|


Trace:
--------------------------------------------------------------------------------
Client-side
                    Server-side
--------------------------------------------------------------------------------

                    INFO: WSSERVLET12: JAX-WS context listener initializing
                    handler.server.HandlerAdams@a1b4e7> (constructor)
                    handler.server.HandlerBoston@6baf24> (constructor)
                    handler.server.HandlerChicago@1b7a553> (constructor)
                    handler.server.HandlerDenver@1c71508> (constructor)
                    handler.server.HandlerEasy@135d18b> (constructor)
                    2/Mai/2008 18:14:48 com.sun.xml.ws.transport.http.servlet.WSServletDelegate init

                    INFO: WSSERVLET14: JAX-WS servlet initializing


Running the hello.HelloServiceClient program...
handler.client.HandlerAlpha@fefe3f> (constructor)
handler.client.HandlerBravo@c2b2f6> (constructor)
handler.client.HandlerCharlie@1a001ff> (constructor)
handler.client.HandlerDelta@90c06f> (constructor)
handler.client.HandlerEcho@1267649> (constructor)
handler.client.HandlerAlpha@fefe3f> getHeaders()
handler.client.HandlerBravo@c2b2f6> getHeaders()
handler.client.HandlerCharlie@1a001ff> getHeaders()
handler.client.HandlerDelta@90c06f> getHeaders()
handler.client.HandlerEcho@1267649> getHeaders()
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>
handler.client.HandlerAlpha@fefe3f> handleMessage() - Outbound SOAP message
handler.client.HandlerBravo@c2b2f6> handleMessage() - Outbound SOAP message
handler.client.HandlerCharlie@1a001ff> handleMessage() - Outbound SOAP message
handler.client.HandlerDelta@90c06f> handleMessage() - Outbound SOAP message
handler.client.HandlerEcho@1267649> handleMessage() - Outbound SOAP message
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>


                    handler.server.HandlerAdams@a1b4e7> getHeaders()
                    handler.server.HandlerBoston@6baf24> getHeaders()
                    handler.server.HandlerChicago@1b7a553> getHeaders()
                    handler.server.HandlerDenver@1c71508> getHeaders()
                    handler.server.HandlerEasy@135d18b> getHeaders()
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></
                    soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerEasy@135d18b> handleMessage() - Inbound SOAP message
                    handler.server.HandlerDenver@1c71508> handleMessage() - Inbound SOAP message
                    handler.server.HandlerChicago@1b7a553> handleMessage() - Inbound SOAP message
                    handler.server.HandlerBoston@6baf24> handleMessage() - Inbound SOAP message
                    handler.server.HandlerAdams@a1b4e7> handleMessage() - Inbound SOAP message
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></
                    soapenv:Body></soapenv:Envelope>
                    Outbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHelloResponse><ns1:return>Hello friend!</ns1:retur
                    n></ns1:sayHelloResponse></soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerAdams@a1b4e7> handleMessage() - Outbound SOAP message
                    handler.server.HandlerBoston@6baf24> handleMessage() - Outbound SOAP message
                    handler.server.HandlerChicago@1b7a553> handleMessage() - Outbound SOAP message
                    handler.server.HandlerDenver@1c71508> handleMessage() - Outbound SOAP message
                    handler.server.HandlerEasy@135d18b> handleMessage() - Outbound SOAP message
                    Outbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHelloResponse><ns1:return>Hello friend!</ns1:retur
                    n></ns1:sayHelloResponse></soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerEasy@135d18b> close()
                    handler.server.HandlerDenver@1c71508> close()
                    handler.server.HandlerChicago@1b7a553> close()
                    handler.server.HandlerBoston@6baf24> close()
                    handler.server.HandlerAdams@a1b4e7> close()


Inbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHelloResponse><ns1:return>Hello friend!</ns1:return></ns1:sayHelloResponse></soapenv:Body></soapenv:Envelope>
handler.client.HandlerEcho@1267649> handleMessage() - Inbound SOAP message
handler.client.HandlerDelta@90c06f> handleMessage() - Inbound SOAP message
handler.client.HandlerCharlie@1a001ff> handleMessage() - Inbound SOAP message
handler.client.HandlerCharlie@1a001ff throwing runtime exception
handler.client.HandlerEcho@1267649> close()
handler.client.HandlerDelta@90c06f> close()
handler.client.HandlerCharlie@1a001ff> close()
handler.client.HandlerBravo@c2b2f6> close()
handler.client.HandlerAlpha@fefe3f> close()
Exception in thread "main" javax.xml.ws.WebServiceException: java.lang.RuntimeException: Client Inbound - Runtime Exception!
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.doSend(SOAPMessageDispatcher.java:296)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.send(SOAPMessageDispatcher.java:153)
	at com.sun.xml.ws.encoding.soap.internal.DelegateBase.send(DelegateBase.java:85)
	at com.sun.xml.ws.client.EndpointIFInvocationHandler.implementSEIMethod(EndpointIFInvocationHandler.java:176)
	at com.sun.xml.ws.client.EndpointIFInvocationHandler.invoke(EndpointIFInvocationHandler.java:105)
	at $Proxy18.sayHello(Unknown Source)
	at hello.HelloServiceClient.main(HelloServiceClient.java:10)
Caused by: java.lang.RuntimeException: Client Inbound - Runtime Exception!
	at handler.client.HandlerCharlie.handleMessage(HandlerCharlie.java:55)
	at handler.client.HandlerCharlie.handleMessage(HandlerCharlie.java:17)
	at com.sun.xml.ws.handler.HandlerChainCaller.callProtocolHandlers(HandlerChainCaller.java:667)
	at com.sun.xml.ws.handler.HandlerChainCaller.internalCallHandlers(HandlerChainCaller.java:434)
	at com.sun.xml.ws.handler.HandlerChainCaller.callHandlers(HandlerChainCaller.java:359)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.callHandlersOnResponse(SOAPMessageDispatcher.java:665)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.receive(SOAPMessageDispatcher.java:535)
	at com.sun.xml.ws.protocol.soap.client.SOAPMessageDispatcher.doSend(SOAPMessageDispatcher.java:288)
	... 6 more
