src_test/test-jax/ws-handlers/etc/trace/ci-ok-so-rf.txt


Handler C... error behaviour:

|--------- |--------------|------------------------|---------------------------|
|          | return false | throw RuntimeException | throw SOAPFaultException  |
|----------|--------------|------------------------|---------------------------|
|Client OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server IN |              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Client IN |              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server OUT|       X      |                        |                           |
|----------|--------------|------------------------|---------------------------|


Trace:
--------------------------------------------------------------------------------
Client-side
                    Server-side
--------------------------------------------------------------------------------

                    INFO: WSSERVLET12: JAX-WS context listener initializing
                    handler.server.HandlerAdams@1d648e2> (constructor)
                    handler.server.HandlerBoston@14b03ea> (constructor)
                    handler.server.HandlerChicago@1edf84f> (constructor)
                    handler.server.HandlerDenver@493dca> (constructor)
                    handler.server.HandlerEasy@77a748> (constructor)
                    2/Mai/2008 18:05:16 com.sun.xml.ws.transport.http.servlet.WSServletDelegate init

                    INFO: WSSERVLET14: JAX-WS servlet initializing


Running the hello.HelloServiceClient program...
handler.client.HandlerAlpha@fefe3f> (constructor)
handler.client.HandlerBravo@c2b2f6> (constructor)
handler.client.HandlerCharlie@1a001ff> (constructor)
handler.client.HandlerDelta@90c06f> (constructor)
handler.client.HandlerEcho@1267649> (constructor)
handler.client.HandlerAlpha@fefe3f> getHeaders()
handler.client.HandlerBravo@c2b2f6> getHeaders()
handler.client.HandlerCharlie@1a001ff> getHeaders()
handler.client.HandlerDelta@90c06f> getHeaders()
handler.client.HandlerEcho@1267649> getHeaders()
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>
handler.client.HandlerAlpha@fefe3f> handleMessage() - Outbound SOAP message
handler.client.HandlerBravo@c2b2f6> handleMessage() - Outbound SOAP message
handler.client.HandlerCharlie@1a001ff> handleMessage() - Outbound SOAP message
handler.client.HandlerDelta@90c06f> handleMessage() - Outbound SOAP message
handler.client.HandlerEcho@1267649> handleMessage() - Outbound SOAP message
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>


                    handler.server.HandlerAdams@1d648e2> getHeaders()
                    handler.server.HandlerBoston@14b03ea> getHeaders()
                    handler.server.HandlerChicago@1edf84f> getHeaders()
                    handler.server.HandlerDenver@493dca> getHeaders()
                    handler.server.HandlerEasy@77a748> getHeaders()
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></
                    soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerEasy@77a748> handleMessage() - Inbound SOAP message
                    handler.server.HandlerDenver@493dca> handleMessage() - Inbound SOAP message
                    handler.server.HandlerChicago@1edf84f> handleMessage() - Inbound SOAP message
                    handler.server.HandlerBoston@14b03ea> handleMessage() - Inbound SOAP message
                    handler.server.HandlerAdams@1d648e2> handleMessage() - Inbound SOAP message
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></
                    soapenv:Body></soapenv:Envelope>
                    Outbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHelloResponse><ns1:return>Hello friend!</ns1:retur
                    n></ns1:sayHelloResponse></soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerAdams@1d648e2> handleMessage() - Outbound SOAP message
                    handler.server.HandlerBoston@14b03ea> handleMessage() - Outbound SOAP message
                    handler.server.HandlerChicago@1edf84f> handleMessage() - Outbound SOAP message
                    handler.server.HandlerChicago@1edf84f returning false
                    handler.server.HandlerEasy@77a748> close()
                    handler.server.HandlerDenver@493dca> close()
                    handler.server.HandlerChicago@1edf84f> close()
                    handler.server.HandlerBoston@14b03ea> close()
                    handler.server.HandlerAdams@1d648e2> close()


Inbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHelloResponse><ns1:return>Hello friend!</ns1:return></ns1:sayHelloResponse></soapenv:Body></soapenv:Envelope>
handler.client.HandlerEcho@1267649> handleMessage() - Inbound SOAP message
handler.client.HandlerDelta@90c06f> handleMessage() - Inbound SOAP message
handler.client.HandlerCharlie@1a001ff> handleMessage() - Inbound SOAP message
handler.client.HandlerBravo@c2b2f6> handleMessage() - Inbound SOAP message
handler.client.HandlerAlpha@fefe3f> handleMessage() - Inbound SOAP message
Inbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHelloResponse><ns1:return>Hello friend!</ns1:return></ns1:sayHelloResponse></soapenv:Body></soapenv:Envelope>
handler.client.HandlerEcho@1267649> close()
handler.client.HandlerDelta@90c06f> close()
handler.client.HandlerCharlie@1a001ff> close()
handler.client.HandlerBravo@c2b2f6> close()
handler.client.HandlerAlpha@fefe3f> close()
Hello friend!
