tags/1_4_1/src_test/test-jax/ws-handlers/etc/trace/ci-rf-so-ok.txt


Handler C... error behaviour:

|--------- |--------------|------------------------|---------------------------|
|          | return false | throw RuntimeException | throw SOAPFaultException  |
|----------|--------------|------------------------|---------------------------|
|Client OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server IN |              |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Client IN |      X       |                        |                           |
|----------|--------------|------------------------|---------------------------|
|Server OUT|              |                        |                           |
|----------|--------------|------------------------|---------------------------|


Trace:
--------------------------------------------------------------------------------
Client-side
                    Server-side
--------------------------------------------------------------------------------

                    INFO: WSSERVLET12: JAX-WS context listener initializing
                    handler.server.HandlerAdams@1fd10fa> (constructor)
                    handler.server.HandlerBoston@165cebb> (constructor)
                    handler.server.HandlerChicago@e77781> (constructor)
                    handler.server.HandlerDenver@56d149> (constructor)
                    handler.server.HandlerEasy@1c634b9> (constructor)
                    2/Mai/2008 18:18:42 com.sun.xml.ws.transport.http.servlet.WSServletDelegate init

                    INFO: WSSERVLET14: JAX-WS servlet initializing

Running the hello.HelloServiceClient program...
handler.client.HandlerAlpha@fefe3f> (constructor)
handler.client.HandlerBravo@c2b2f6> (constructor)
handler.client.HandlerCharlie@1a001ff> (constructor)
handler.client.HandlerDelta@90c06f> (constructor)
handler.client.HandlerEcho@1267649> (constructor)
handler.client.HandlerAlpha@fefe3f> getHeaders()
handler.client.HandlerBravo@c2b2f6> getHeaders()
handler.client.HandlerCharlie@1a001ff> getHeaders()
handler.client.HandlerDelta@90c06f> getHeaders()
handler.client.HandlerEcho@1267649> getHeaders()
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>
handler.client.HandlerAlpha@fefe3f> handleMessage() - Outbound SOAP message
handler.client.HandlerBravo@c2b2f6> handleMessage() - Outbound SOAP message
handler.client.HandlerCharlie@1a001ff> handleMessage() - Outbound SOAP message
handler.client.HandlerDelta@90c06f> handleMessage() - Outbound SOAP message
handler.client.HandlerEcho@1267649> handleMessage() - Outbound SOAP message
Outbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></soapenv:Body></soapenv:Envelope>


                    handler.server.HandlerAdams@1fd10fa> getHeaders()
                    handler.server.HandlerBoston@165cebb> getHeaders()
                    handler.server.HandlerChicago@e77781> getHeaders()
                    handler.server.HandlerDenver@56d149> getHeaders()
                    handler.server.HandlerEasy@1c634b9> getHeaders()
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></
                    soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerEasy@1c634b9> handleMessage() - Inbound SOAP message
                    handler.server.HandlerDenver@56d149> handleMessage() - Inbound SOAP message
                    handler.server.HandlerChicago@e77781> handleMessage() - Inbound SOAP message
                    handler.server.HandlerBoston@165cebb> handleMessage() - Inbound SOAP message
                    handler.server.HandlerAdams@1fd10fa> handleMessage() - Inbound SOAP message
                    Inbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHello><ns1:name>friend</ns1:name></ns1:sayHello></
                    soapenv:Body></soapenv:Envelope>
                    Outbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHelloResponse><ns1:return>Hello friend!</ns1:retur
                    n></ns1:sayHelloResponse></soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerAdams@1fd10fa> handleMessage() - Outbound SOAP message
                    handler.server.HandlerBoston@165cebb> handleMessage() - Outbound SOAP message
                    handler.server.HandlerChicago@e77781> handleMessage() - Outbound SOAP message
                    handler.server.HandlerDenver@56d149> handleMessage() - Outbound SOAP message
                    handler.server.HandlerEasy@1c634b9> handleMessage() - Outbound SOAP message
                    Outbound SOAP message:
                    <?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.or
                    g/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http:/
                    /hello"><soapenv:Body><ns1:sayHelloResponse><ns1:return>Hello friend!</ns1:retur
                    n></ns1:sayHelloResponse></soapenv:Body></soapenv:Envelope>
                    handler.server.HandlerEasy@1c634b9> close()
                    handler.server.HandlerDenver@56d149> close()
                    handler.server.HandlerChicago@e77781> close()
                    handler.server.HandlerBoston@165cebb> close()
                    handler.server.HandlerAdams@1fd10fa> close()


Inbound SOAP message:
<?xml version="1.0" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://hello"><soapenv:Body><ns1:sayHelloResponse><ns1:return>Hello friend!</ns1:return></ns1:sayHelloResponse></soapenv:Body></soapenv:Envelope>
handler.client.HandlerEcho@1267649> handleMessage() - Inbound SOAP message
handler.client.HandlerDelta@90c06f> handleMessage() - Inbound SOAP message
handler.client.HandlerCharlie@1a001ff> handleMessage() - Inbound SOAP message
handler.client.HandlerCharlie@1a001ff returning false
handler.client.HandlerEcho@1267649> close()
handler.client.HandlerDelta@90c06f> close()
handler.client.HandlerCharlie@1a001ff> close()
handler.client.HandlerBravo@c2b2f6> close()
handler.client.HandlerAlpha@fefe3f> close()
Hello friend!
